Repository: alaahadid/My-Nes
Catalog: MyNes/Properties/Resources.*.resx
Languages: ar

# GettingStartedNotes
source: NOTES: These are the default configurations by default: - If a Xbox Controller is connected, it will be assigned automatically: X Controller player 1 for nes player 1, player 2 for nes player 2... player 4 for nes player 4. - If a controller is assigned, then it is disconnected, My Nes will automatically switch back into keyboard. - When you use the launcher to launch a game, then you want the launcher to return, press F1/Escape to shutdown the emulation. This should bring up the launcher dialog back.
ar: ملاحظات: افتراضيا, هذه هي الاعدادات الاخرى: . اذا كان لديك قبضات اكس بوكس متصلة, سيقوم البرنامج اوتوماتيكيا بتعيين هذه القبضات: اللاعب الاول مع اللاعب الاول في المحاكي, اللاعب الثاني مع اللاعب الثاني في المحاكي و هكذا. اكبر عدد ممكن هو 4 لاعبين. . اذا كانت قبضة ما معينة مسبقا, ثم تم فصل تلك القبضة, سيقوم المحاكي باعادة التعين الى لوحة المفاتيح اوتوماتيكيا. . عندما تستخدم المستعرض لتشغيل لعبة ما, و تريد اعادة المستعرض بسرعة, كل ما عليك فعله هو ايقاف تشغيل المحاكي, اما بالضغط على F1 أو Escape

# Status50
source: Sound Filters Enabled
ar: تم تفعيل منقيات الصوت

# Status51
source: Sound Filters Disabled
ar: تم الغاء تفعيل منقيات الصوت

# Status52
source: My Nes sound mixer enabled
ar: تم تفعيل الميكسر

# Status53
source: My Nes sound mixer disabled (using default nes mixer, as in wiki)
ar: تم الغاء تفعيل الميكسر, تم تفعيل الميكسر الافتراضي

# Status54
source: State slot set to
ar: تم وضع منفذ الحالة

# Status55
source: Volume
ar: الصوت

# Filter_Text
source: Text File (*.txt)|*.txt
ar: ملف نصّي (*.txt)|*.txt
