Repository: alaahadid/My-Nes
Catalog: MyNes/Properties/Resources.*.resx
Languages: ar

# Desc2
source: Please select a master folder where to save the downloaded files (empty folder is recommended)
ar: الرجاء اختيار مجلد اساسي لتحميل الملفات اليه, ينصح بان يكون المجلد خاليا

# Message14
source: No folder to search
ar: لا يوجد اي مجلد للبحث.

# Button4
source: Dont Delete Nes Cart Entries
ar: لا تحذف مداخل Nes Cart

# Message18
source: Sound Records folder is not exist !!
ar: مجلد تسجيلات الصوت ليس موجود !!

# Status28
source: Loading entries from the database
ar: جاري تحميل المدخلات من قاعدة البيانات

# I2
source: INES Header
ar: INES هيدر

# Status14
source: Last saved at
ar: اخر مرة حفظ في

# S10
source: Does Not Equal
ar: لا يساوي

# I4
source: Size
ar: حجم

# Message42
source: Please Select One Game To Open Location
ar: الرجاء اختيار لعبة واحدة

# Message43
source: Game File Not Exist Or No File Assigned To This Game Yet
ar: ملف اللعبة غير موجود او لم يتم تعيين اي ملف بعد لهذا المدخل

# Message44
source: Please Select One Game To Show Info Of
ar: الرجاء اختيار لعبة واحدة لاظهار ملف البيانات

# MessageCap4
source: Remove Code
ar: حذف كود

# Message20
source: States folder is not exist !!
ar: مجلد الحالة ليس موجود !!

# Text0
source: Never Played
ar: لم يتم لعبها بعد

# Status40
source: Snapshot taken.
ar: تم التقاط صورة

# Status31
source: Entry Skipped
ar: مدخل تم تجاهله

# Message12
source: The folder for Screenshots is not exist
ar: مجلد Screenshots ليس موجود

# Message4
source: Coninue ?
ar: اكمال ؟

# Message28
source: Please enter the game title first.
ar: الرجاء ادخال اسم اللعبة اولا

# Status39
source: UNABLE TO SHOW IMAGE
ar: غير قادر على عرض الصورة

# Desc11
source: Open Rom
ar: فتح لعبة

# Message22
source: This file is not My Nes GameGenie Codes List file
ar: هذا الملف ليس بملف My Nes GameGenie Codes List

# Status3
source: Applying Database
ar: جاري تطبيق على قاعدة البيانات

# Button0
source: &Save
ar: &حفظ

# Status9
source: Detecting
ar: جاري الالتقاط

# status10
source: Detected
ar: تم التقاطها

# Message33
source: Palette file not exist or selected
ar: ملف الالوان ليس موجود او مختار

# Status34
source: is archive but can't be opened.
ar: هو مضغوط لكن لا يمكن فتحه

# S8
source: Does Not End With
ar: لا ينتهي مع

# Desc5
source: Detect Info Files
ar: التقاط تلقائي لملفات المعلومات

# Message6
source: Please select a Platform first
ar: الرجاء اختيار منصة اولا

# Message26
source: No code in the list to save!
ar: لا يوجد اي كود للحفظ

# Filter_Palette
source: Palette file '64 indexes' (*.pal)|*.pal|Palette file '512 indexes' (*.pal)|*.pal
ar: ملف الاون '64 indexes' (*.pal)|*.pal|Palette file '512 indexes' (*.pal)|*.pal

# Message15
source: No extension added yet
ar: لم يتم اضافة اية لاحقة بعد

# Button3
source: Dont Delete
ar: لا تحذف

# Status29
source: Searching Files
ar: جاري البحث عن الملفات

# Status17
source: Region set to
ar: تم اختيار المنطقة

# Status41
source: Recording Audio
ar: جاري تسجيل الصوت

# Message8
source: The folder for BoxartBack is not exist
ar: مجلد BoxartBack ليس موجود

# Status27
source: files found
ar: ملف تم ايجاده

# Button1
source: &Load
ar: &تحميل

# Filter_Image
source: Image (*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga)|*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga
ar: صورة (*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga)|*.jpg;*.png;*.bmp;*.gif;*.jpeg;*.tiff;*.tga

# Desc12
source: Add More Images
ar: اضافة المزيد من الصور

# Message32
source: Unable To Load Palette File
ar: غير قادر على تحميل ملف الالوان

# Status5
source: Downloading file
ar: جاري تحميل الملف

# Text1
source: One Time
ar: مرة واحدة

# Message1
source: Log file saved to
ar: تم حفظ ملف الاحداث في

# Desc9
source: Browse for Game Genie Codes folder
ar: استعراض مجلد كودات الجيم جني

# Status22
source: Updating Database
ar: جاري تحديث قاعدة البيانات

# Message50
source: Unable To Remove File
ar: غير قادر على حذف الملف

# I9
source: PRG Size
ar: PRG حجم

# Desc3
source: Detect Snapshots
ar: التقاط تلقائي للصور

# S3
source: Is
ar: مماثل

source: Seconds
ar: ثواني

# Desc15
source: Load state as
ar: تحميل الحالة باسم

# Desc10
source: Browse for Sound Records folder
ar: استعراض مجلد تسجيلات الصوت

# Message3
source: These folders will be created
ar: هذه المجلدات سيتم انشاؤها

# I18
source: Cartridge
ar: الشريط

# I8
source: PRG Count
ar: PRG عدد

# Message9
source: The folder for BoxartFront is not exist
ar: مجلد BoxartFront ليس موجود

# Message36
source: My Nes needs to be restarted in order to renderer change take effect.
ar: يجب اعادة تشغيل البرنامج لكي يتم تفعيل المخرج المختار

# Message16
source: Game Genie Codes folder is not exist !!
ar: مجلد كودات جيم جني ليست موجودة !!

# Button2
source: Delete
ar: حذف

# Status4
source: Finishing
ar: جاري الانهاء

# Desc8
source: Browse for Save-RAMs folder
ar: استعراض مجلد اس رام

# Status24
source: Generating Default Entries From NesCartDB
ar: جاري انشاء المدخلات الافتراضية من NesCartDB

# Message39
source: Please Select One Game To Play
ar: الرجاء اختيار لعبة واحدة للعب

# S7
source: Ends With
ar: ينتهي مع

# MessageCap8
source: Remove Image
ar: حذف الصورة

# Message35
source: Unable to open archive file
ar: غير قادر على فتح الملف المضغوط

# Desc16
source: Add Files To The Database
ar: اضافة ملفات الى قاعدة البيانات

# Message10
source: The folder for Fanart is not exist
ar: مجلد Fanart ليس موجود

# Status6
source: XXX Unable to download file from
ar: XXX غير قادر على تحميل الملف من

# MessageCap2
source: Detect
ar: التقاط تلقائي

# S12
source: Euqal OR Larger
ar: اكبر او يساوي

# MessageCap5
source: Find Games
ar: البحث عن العاب

# Message45
source: No Entry Selected To Delete
ar: لم يتم اختيار اي مدخل للحذف

# Filter_State
source: My Nes State (*.mns)|*.mns
ar: My Nes ملف حالة (*.mns)|*.mns

# Filter_Database
source: My Nes Database (*.mndb)|*.mndb
ar: My Nes قاعدة بيانات (*.mndb)|*.mndb

# Status26
source: Total Of
ar: اجمالي

# Message37
source: Another operation is in progress
ar: عملية اخرى قيد التشغيل

# Message41
source: Are You Sure You Want To Create New DB
ar: هل انت واثق من انشاء قاعدة بيانات جديدة

# Desc14
source: Save state as
ar: حفظ الحالة باسم

# I0
source: Property
ar: خاصية

# Message31
source: Please select the search by column first
ar: الرجاء اختيار اسم العامود للبحث اولا

# Message40
source: Game File Not Exist Or No File Assigned To This Game Yet
ar: ملف اللعبة غير موجود او لم يتم تعيين اي ملف بعد لهذا المدخل

# Text2
source: Times
ar: مرات

# Message2
source: Do you want to open the log file ?
ar: هل تريد فتح ملف الاحداث ؟

# Message47
source: Info Copied Into The Clipboard
ar: تم نسخ المعلومات الى الذاكرة

# I19
source: DataBase
ar: قاعدة بيانات

# Status37
source: Deleting Entries
ar: جاري حذف المداخل

# Status23
source: Default Entries From NesCartDB Generated Successfully
ar: تم انشاء المدخلات الافتراضية ل NesCartDB بنجاح

# Message24
source: Enter Comment
ar: ادخل تعليقا

# Filter_Rom
source: Supported file types (*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz|INES (*.nes)|*.nes|Archive (*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz
ar: الانواع المدعومة (*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.nes;*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz|INES (*.nes)|*.nes|مضغوط (*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz)|*.7z;*.zip;*.rar*.gzip;*.tar;*.bzip2;*.xz

# I13
source: Is VS-Unisystem
ar: هل هو في اس سيستم

# Message48
source: Are You Sure To Remove Image
ar: هل انت واثق من حذف الصورة ؟

# Status0
source: Getting entries for selected platform
ar: الحصول على المدخلات للمنصة

# S6
source: Does Not Start With
ar: لا يبدا مع

# Message30
source: Please enter the search word first
ar: الرجاء ادخال كلمة البحث اولا

# Status35
source: Updating Columns In The Database
ar: جاري تحديث الاعمدة

# Message21
source: Nes is off
ar: المحاكي ليس شغال

# I17
source: Game Info
ar: معلومات عن اللعبة

# S2
source: Does Not Contain
ar: لا يحوي

# Status36
source: Ready.
ar: جاهز.

# S4
source: Is Not
ar: غير مماثل

# Status16
source: No data found for this game in this slot.
ar: لا يوجد بيانات للعبة في هذا المنفذ

# Message25
source: Are you sure ?
ar: هل انت متاكد ؟

# Status7
source: Saving file at
ar: جاري حفظ الملف في

# MessageCap3
source: GameGenie Code
ar: كود جيم جني

# S11
source: Larger
ar: اكبر من

# Message38
source: No Database loaded yet
ar: لم يتم تحميل اية قاعدة بيانات بعد

source: SLOT
ar: منفذ

# I10
source: Has Battery
ar: لديه بطارية

# Status11
source: Downloading
ar: جاري التحميل

# Message34
source: Palette file already exists, would you like to replace the palette file ?
ar: ملف الالوان موجود سابقا, هل تود استبداله ؟

# I12
source: Is Playchoice10
ar: هل هو بلايشوس 10

# S13
source: Smaller
ar: اصغر من

# Message52
source: Please select the input device first.
ar: الرجاء اختيار جهاز الادخال اولا

# Desc13
source: Choose Where To Download The Files
ar: اختيار اين سيتم تحميل الملفات

# Message19
source: Save-RAMs folder is not exist !!
ar: مجلد الاس رام ليس موجود !!

# Desc1
source: Save My Nes Database File
ar: حفظ ملف قاعدة بيانات

# MessageCap1
source: Detect And Download From The Games DB
ar: التقاط و تحميل من The Games DB

# Message17
source: Snapshots folder is not exist !!
ar: مجلد الصور ليس موجود !!

# Status20
source: Volume
ar: مستوى الصوت

# Message46
source: Are You Sure You Want To Delete Selected Entries
ar: هل انت واثق من حذف المداخل المختارة

# I16
source: Game Info From NesCart Database
ar: المعلومات من NesCart

# Status25
source: Calculating Files
ar: جاري حساب الملفات

# Status38
source: No Game Selected
ar: لم يتم اختيار اي لعبة

# Status13
source: Canceling in
ar: سيتم الالغاء التلقائي بعد

# desc7
source: Browse for States folder
ar: استعراض مجلد الحالة

# I7
source: CHR Size
ar: CHR حجم

# Status1
source: Collecting the roms
ar: الحصول على الرومات

# Status18
source: GameGenie Connected
ar: تم وصل جيم جني

# Message27
source: There is no code in the list
ar: لا يوجد اي كود في القائمة

# Message11
source: The folder for Overview is not exist
ar: مجلد Overview ليس موجود

# I14
source: Mirroring
ar: المراة

# I3
source: Path
ar: مسار

# ErrorStatus
source: ERROR
ar: خطأ

# Status15
source: Unable to load state file info !!
ar: لم يتمكن من تحميل معلومات الحالة

# Status19
source: GameGenie Disconnected
ar: تم الغاء وصل جيم جني

# I5
source: Mapper Number
ar: رقم المابر

# S5
source: Start With
ar: يبدا مع

# Desc0
source: Add folder to the scan list
ar: اضافة مجلد الى قائمة البحث

# Status21
source: Adding Entries
ar: جاري اضافة المدخلات

# Status30
source: Entry UPDATED
ar: مدخل تم تحديثه

source: Version
ar: النسخة

# Message13
source: Are you sure you want to delete selected folders ?
ar: هل انت متاكد من حذف المجلدات المختارة ؟

# MessageCap7
source: Delete Entries
ar: حذف المداخل

# I1
source: Value
ar: القيمة

# I15
source: File Info
ar: معلومات الملف

# S1
source: Contains
ar: يحوي

source: Done
ar: تم

# Desc6
source: Browse for Snapshots folder
ar: استعراض مجلد الصور

# Message5
source: Are you sure you want to stop current proccess ?
ar: هل انت واثق من ايقاف العملية الحالية ؟

# Message29
source: Please select one result first
ar: الرجاء اختيار نتيجة اولا

# Status32
source: Entry ADDED
ar: مدخل تم اضافته

# MessageCap6
source: Create New Database
ar: انشاء قاعدة بيانات جديدة

# Message51
source: Are You Sure To Remove All Images
ar: هل انت واثق من حذف كافة الصور

# S14
source: Equal OR Smaller
ar: اصغر او يساوي

# Message23
source: Code already exist in the list
ar: الكود موجود سابقا في القائمة

# Status2
source: Comparing
ar: جاري المقارنة

# Message0
source: You must select one folder to search
ar: يجب اختيار مجلد واحد للبحث

# Message49
source: Remove File From Disk Too
ar: حذف الملف من القرص ايضا ؟

# Status8
source: Database import operation finished at
ar: استيراد قاعدة البيانات تمت في

# Status33
source: File
ar: ملف

# S9
source: Equal
ar: يساوي

# Status12
source: Press key for
ar: اضغط زرا ل

# Desc4
source: Detect Covers
ar: التقاط تلقائي للاغلفة

# I11
source: Has Trainer
ar: لديه ترينر

# Message7
source: The folder for Banners is not exist
ar: مجلد Banners ليس موجود

# I6
source: CHR Count
ar: CHR عدد

# Button5
source: Stop Recording Sound
ar: توقيف تسجيل الصوت

# Button6
source: Record Sound
ar: تسجيل الصوت

# Message53
source: The selected interface language will be applied next time you start My Nes.
ar: نصوص اللغة المختارة سيتم تفعيلها في المرة القادة التي تشغل فيها البرنامج

# MessageCap9
source: Change Interface Language
ar: تغيير لغة الواجهة

# Status42
source: 4 Players now connected.
ar: تم وصل اربع لاعبين

# Status43
source: 4 Players now disconnected.
ar: تم الغاء توصيل اربع لاعبين

# Name1
source: X Controller Player One
ar: X Controller اللاعب الاول

# Name2
source: X Controller Player Two
ar: X Controller اللاعب الثاني

# Name3
source: X Controller Player Three
ar: X Controller اللاعب الثالث

# Name4
source: X Controller Player Four
ar: X Controller اللاعب الرابع

# GettingStartedDesc
source: Both renderers, SlimdDX and SDL2 Produce the best video/sound quality possible with My Nes, each renderer is carefully configured for best quality and performance. * Slimdx renderers render using Direct3d9 for video and DirectSound for sound. - Sometimes the video drops into 30 fps even though there is no game loaded, this is a windows related issue. Restarting My Nes may fix this problem, but If it remains, there is no choice but to switch into SDL2 Video. - Sometimes SlimDX video renderer makes My Nes craches. Sorry for this bug, still have no idea what's the problem excatly... still working on fixing it though, all you need to do is to restart My Nes and try again to run the game. - Video renderer run slow on low-end pcs and laptops. After tests, it needs at least 2400 Hz cpu to function probably. The fps drop will be something like latency issues, sound corruption, fps unstability... etc. * SDL2 renderers render using SDL2 library. The video renderer can be set to direct3d or opengl driver. - Run with no speed issues on low-end pcs and laptops. - No issues found in these renderer except sometimes sound glitches but it's so little that should not be bothering. There is no big difference between these renderers, since renderers in fact just act as outputs presenters. The only difference you may notice is with performance, you need to carefully choose and configure My Nes to run smoothly in your machine. Also you can mix renderers, for example, you can use SlimDX for video and SDL2 for sound... Renderers can be switched anytime from the main menu, note that changing a renderer requires My Nes to restart to take effect. As default, My Nes is set to use SlimDX for video (Direct3d9) and sound (DirectSound) rendering. After tests, this is the best you can get from My Nes. As above, you need to carefully choose and configure My Nes to run smoothly in your machine. For most machines i test, SDL2 for video and SlimDX (DirectSound) for sound is the best choice for both quality and performance. WARNING! My Nes may fail to launch with SDL2 video renderer. If that happens, you need to locate the settings file in: Documents>MyNes>sdlsettings.ini Open that file then edit the line: "Video_Driver=opengl" or "Video_Driver=direct3d" then try again. direct3d: is the direct3d driver opengl: is the opengl driver If both drivers doesn't work, there is no choice but to switch into SlimDX video renderer.
ar: Slimdx يستخدم Direct3d9 للصورة و DirectSound للصوت. SDL2 تستخدم مكاتبSDL2, يمكن تغيير السائق بين direct3d و opengl كلا المكتبتان تنتجان نفس جودة الصورة و الصوت الممتازة, الفرق الوحيد هو في الاداء و السرعة. الرجاء اختر ما يتناسب مع جهازك, ينصح ب SDL2 للصوة و الصوت

# SDL2SettingsWarning
source: WARNING! My Nes may fail to launch after changing the driver setting. If that happens, you need to locate the settings file in: Documents>MyNes>sdlsettings.ini, either delete the file, or modify this line in that settings file: "Video_Driver=opengl" or "Video_Driver=direct3d" then try again. direct3d: is the direct3d driver opengl: is the opengl driver
ar: تحذير قد يفشل البرنامج في الاقلاع بعد تغيير اعدادات السائق او التعريف. لحل تلك المشكلة الرجاء اذهب الى الملف: Documents>MyNes>sdlsettings.ini احذف الملف او عدل السطر: "Video_Driver=opengl" الى "Video_Driver=direct3d" ثم حاول مجددا.

# Status44
source: Full screen mode, press ESCAPE to switch back into windowed mode.
ar: وضع الشاشة الكاملة, الرجاء الضغط على Escape للعودة الى النافذة

# CoreMapper
source: Mapper
ar: مابر

# CoreMessage_Error1
source: Can't save state, emu is off.
ar: لا يمكن حفظ الحالي, المحاكي غير مشغل

# CoreMessage_Error10
source: Unable load state at slot
ar: لا يمكن تحميل الحالة من المنفذ

# CoreMessage_Error11
source: Not My Nes State File !
ar: ليس بملف حالة

# CoreMessage_Error12
source: Not compatible state file version !
ar: نسخة غير متطابقة من ملف الحالة

# CoreMessage_Error13
source: This state file is not for this game; not same SHA1 !
ar: ملف الحالة هذا ليس لهذه اللعبة

# CoreMessage_Error14
source: IS NOT LOCATED, mapper is not supported or unable to find it.
ar: لا يمكن ايجادها, المبر غير مدعوم او غير موجود

# CoreMessage_Error15
source: will be used instead, assigned successfully.
ar: سيتم استخدامها بدلا من ذلك, تم التعيين بنجاح

# CoreMessage_Error16
source: Game Genie code length cannot be more than 8 letters
ar: طول كود الجيم جني لا يمكن ان يكون اكثر من 8 احرف

# CoreMessage_Error17
source: has issues and may not function probably with this game.
ar: يوجد فيه مشاكل و قد لايعمل بشكل صحيح مع هذه اللعبة

# CoreMessage_Error2
source: Can't save state, no rom file is loaded.
ar: لا يمكن حفظ الحالة, لا يوجد لعبة محملة

# CoreMessage_Error3
source: Can't save state while loading a state !
ar: لا يمكن حفظ الحالة و تحميل الحالة بنفس الوقت

# CoreMessage_Error4
source: Already saving state !!
ar: جاري حفظ الحالة حاليا

# CoreMessage_Error5
source: Can't load state, emu is off.
ar: لا يمكن تحميل الحالة, المحاكي غير شغال

# CoreMessage_Error6
source: Can't load state, no rom file is loaded.
ar: لا يمكن تحميل الحال, لا يوجد لعبة محملة

# CoreMessage_Error7
source: Can't load state while saving a state !
ar: لا يمكن تحميل الحالة و حفظ الحالة بنفس الوقت

# CoreMessage_Error8
source: Already loading state !!
ar: جاري تحميل الحالة حاليا

# CoreMessage_Error9
source: No state found in slot
ar: لا يوجد بيانات في المنفذ

# CoreMessage_GameGenieCanBeConfiguredOnly
source: Game Genie can be enabled/configured only when emulation is on (i.e. game is loaded)
ar: يمكن تفعيل او تعديل جيم جني فقط في حال كان هناك لعبة محملة

# CoreMessage_HardReset
source: HARD RESET !
ar: اعادة تشغيل

# CoreMessage_HardResetCanBeUsedOnly
source: Hard reset can be used only when emulation is on (i.e. game is loaded)
ar: اعادة التشغيل يمكن استخدامها فقط عند المحاكاه

# CoreMessage_Info1
source: State saved at slot
ar: تم حفظ الحالة في المنفذ

# CoreMessage_Info2
source: State loaded from slot
ar: تم تحميل الحالة من المنفذ

# CoreMessage_Info3
source: Snapshot saved
ar: تم حفظ الصورة

# CoreMessage_Info4
source: Interface language set to
ar: تم تعين لغة الواجهات الى

# CoreMessage_LoadStateCanBeUsedOnly
source: Load state as can be used only when emulation is on (i.e. game is loaded)
ar: يمكن تحميل الحالة فقط عند المحاكاة

# CoreMessage_Paused
source: PAUSED
ar: توقيف موئقت

# CoreMessage_PleaseRestartToApply
source: Please restart My Nes to apply.
ar: الرجاء اعادة تشغيل البرنامج للتفعيل

# CoreMessage_RomInfoCanBeOnlyShown
source: Rom info can be shown only when emulation is on (i.e. game is loaded)
ar: يمكن عرض بيانات اللعبة فقط عند المحاكاة

# CoreMessage_SaveStateCanBeUseOnly
source: Save state as can be used only when emulation is on (i.e. game is loaded)
ar: يكن حفظ الحالة فقط عند المحاكاة

# CoreMessage_SoftReset
source: SOFT RESET !
ar: اعادة تشغيل سوفت

# CoreMessage_SoftResetCanBeUsedOnly
source: Soft reset can be used only when emulation is on (i.e. game is loaded)
ar: اعادة تشغيل سوفت تعمل فقط عند المحاكاة

# CoreMessage_StateSlotSetTo
source: State slot set to
ar: تم تحديد المنفذ

# CoreMessage_TurboCanBeToggledOnly
source: Turbo can be toggled only when emulation is on (i.e. game is loaded)
ar: توربو يمكن تشغيلها فقط عند المحاكاة

source: No
ar: لا

# Status45
source: Total of
ar: اجمالي

# Status46
source: board(s) supported.
ar: مبر مدعوم

source: Yes
ar: نعم

# IssueMapper105
source: Game hangs on title screen !
ar: اللعبة تتوقف في البداية

# IssueMapper119
source: Mapper 119 does not function probably
ar: Mapper 119 لا يعمل بشكل صحيح

# IssueMapper154
source: Game shows glitches with chr
ar: اللعبة تظهر مشاكل في الرسوم

# IssueMapper180
source: Crazy Climber needs special controller which not implemented yet
ar: Crazy Climber تحتاج الى تحكم لم يتم محاكاته بعد

# IssueMapper193
source: Game show nothing but fighter sprite !
ar: لا تظهر اللعبة شيئا غير المقاتل

# IssueMapper202
source: 150 in 1: some games not work well. Is it mapper or rom dump ?
ar: 150 in 1: بعض الالعاب لا تعمل بشكل صحيح, هل هو المابر ام الملف

# IssueMapper203
source: 64-in-1: some games not work, maybe something wrong with the implementation or the rom itself
ar: 64-in-1: بعض الالعاب لا تعمل بشكل صحيح, هل هو المابر ام الملف

# IssueMapper207
source: Fudou Myouou Den is not assigned as mapper 207 while it should be !
ar: Fudou Myouou Den لم يتم تعينها للمابر 207 كما يتوجب

# IssueMapper222
source: Mapper 222 is not tested, issues may occur
ar: Mapper 222 لم يتم اختباره, قد تظهر مشاكل محتملة

# IssueMapper228
source: Mapper 228 does not function probably
ar: Mapper 228 لا يعمل بشكل صحيح

# IssueMapper229
source: Mapper 229 is not tested, issues may occur
ar: Mapper 229 لم يتم اختباره, قد تظهر مشاكل محتملة

# IssueMapper230
source: Only Contra works !?
ar: فقط Contra تعمل

# IssueMapper243
source: Shows glitches in some games.
ar: يظهر مشاكل في الرسوم

# IssueMapper245
source: Graphic glitches, maybe chr switches.
ar: يظهر مشاكل في الرسوم

# IssueMapper255
source: Mapper 255 is not tested, issues may occur
ar: Mapper 255 لم يتم اختباره, قد تظهر مشاكل محتملة

# IssueMapper33
source: Mapper 33: Akira is not working for unknown reason.
ar: Mapper 33: Akira لا تعمل لسبب مجهول

# IssueMapper44
source: In game Super Big 7 - in - 1 : Double Dragon 3 game does not work.
ar: In game Super Big 7 - in - 1 : Double Dragon 3 لا تعمل

# IssueMapper5
source: Split screen not implemented.\nUchuu Keibitai SDF game graphic corruption for unknown reason in the intro (not in the split screen).
ar: Split screen لم يتم دعم. Uchuu Keibitai SDF game اخطاء في الرسوم في بداية اللعبة لسبب مجهول.

# IssueMapper53
source: Mapper 53 does not work with the test roms i have, maybe something wrong with the implementation or the roms themselves
ar: Mapper 53 بعض الالعاب لا تعمل بشكل صحيح, هل هو المابر ام الملف

# IssueMapper56
source: Mapper 56 does not work with the test roms i have, maybe something wrong with the implementation or the roms themselves
ar: Mapper 56 بعض الالعاب لا تعمل بشكل صحيح, هل هو المابر ام الملف

# IssueMapper58
source: Study and Game 32-in-1 (Ch) [!].nes needs keyboard ?
ar: Study and Game 32-in-1 (Ch) [!] تحتاج دعم كيبورد

# IssueMapper6
source: Mapper 6 is not tested, issues may occur
ar: Mapper 6 لم يتم اختباره, قد تظهر مشاكل محتملة

# IssueMapper60
source: Mapper 60 does not work with the test roms i have, maybe something wrong with the implementation or the roms themselves
ar: Mapper 60 بعض الالعاب لا تعمل بشكل صحيح, هل هو المابر ام الملف

# IssueMapper8
source: Mapper 8 is not tested, issues may occur
ar: Mapper 8 لم يتم اختباره, قد تظهر مشاكل محتملة

# IssueMapper85
source: VRC7 sound channels are not supported
ar: VRC7 قنوات الصوت غير مدعومة

# IssueMapper90
source: DipSwitch is not implemented, the irq modes 2-3 are not implemented yet.
ar: DipSwitch لم يتم دعم, irq أوضاع 2-3 لم يتم دعم

# IssueMapper96
source: Mapper 96 does not function probably and needs special controller to be implemented.
ar: Mapper 96 لا يعمل بشكل صحيح, لربما بحاجة الى تحكمات خاصة
